<a href="https://colab.research.google.com/github/Gilberto2812/Estad-stica/blob/main/Limpieza_de_datos.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [6]:
df<-read.csv("https://data.ny.gov/api/views/w34r-gwfk/rows.csv?accessType=DOWNLOAD&sorting=true")

In [10]:
str(df)

'data.frame':	2180 obs. of  3 variables:
 $ Period.Ending : chr  "07/31/2003" "07/31/2003" "07/31/2003" "07/31/2003" ...
 $ Region        : chr  "Capital" "Central New York" "Finger Lakes" "Hudson Valley" ...
 $ Initial.Claims: int  4326 4366 7095 8454 13575 3210 45703 2529 3335 11484 ...

In [8]:
fecha<-as.Date(df$Period.Ending,format = "%m/%d/%Y")

In [11]:
mon<-gsub(",","",df$Initial.Claims)
monto<-as.numeric(mon)

In [12]:
ndf<-data.frame(Fecha=fecha,Monto=monto)
head(ndf)

  Fecha      Monto
1 2003-07-31  4326
2 2003-07-31  4366
3 2003-07-31  7095
4 2003-07-31  8454
5 2003-07-31 13575
6 2003-07-31  3210

In [13]:
nd<-na.omit(ndf)
str(nd)

'data.frame':	2180 obs. of  2 variables:
 $ Fecha: Date, format: "2003-07-31" "2003-07-31" ...
 $ Monto: num  4326 4366 7095 8454 13575 ...

In [37]:
nd$Fecha1 <- paste("01-",format(as.Date(nd$Fecha), "%m-%Y"),sep="")
head(nd)

  Fecha      Monto Fecha1
1 2003-07-31  4326 01-07-2003
2 2003-07-31  4366 01-07-2003
3 2003-07-31  7095 01-07-2003
4 2003-07-31  8454 01-07-2003
5 2003-07-31 13575 01-07-2003
6 2003-07-31  3210 01-07-2003

In [38]:
nd$Fecha1<-as.Date(nd$Fecha1,format="%d-%m-%Y")

In [39]:
head(nd)

  Fecha      Monto Fecha1
1 2003-07-31  4326 2003-07-01
2 2003-07-31  4366 2003-07-01
3 2003-07-31  7095 2003-07-01
4 2003-07-31  8454 2003-07-01
5 2003-07-31 13575 2003-07-01
6 2003-07-31  3210 2003-07-01

In [40]:
fdf<-data.frame(Fecha=as.Date(nd$Fecha1,format="%d-%m-%Y"),Monto=nd$Monto)
head(fdf)

  Fecha      Monto
1 2003-07-01  4326
2 2003-07-01  4366
3 2003-07-01  7095
4 2003-07-01  8454
5 2003-07-01 13575
6 2003-07-01  3210

In [41]:
library(dplyr)
gdf<-fdf %>% group_by(Fecha) %>% summarise(Monto_mensual = sum(Monto))
gdf<-gdf[order(gdf$Fecha),]

In [42]:
gdf

    Fecha      Monto_mensual
1   2003-07-01 104077
2   2003-08-01  79020
3   2003-09-01  83405
4   2003-10-01  79162
5   2003-11-01  91740
6   2003-12-01 125729
7   2004-01-01 115483
8   2004-02-01  93513
9   2004-03-01  78853
10  2004-04-01  93964
11  2004-05-01  70053
12  2004-06-01  81215
13  2004-07-01  93699
14  2004-08-01  78228
15  2004-09-01  68238
16  2004-10-01  75268
17  2004-11-01  93040
18  2004-12-01 100136
19  2005-01-01 128595
20  2005-02-01  81110
21  2005-03-01  78626
22  2005-04-01  72421
23  2005-05-01  84816
24  2005-06-01  73815
25  2005-07-01  88522
26  2005-08-01  73863
27  2005-09-01  62512
28  2005-10-01  81035
29  2005-11-01  86301
30  2005-12-01  90627
⋮   ⋮          ⋮
189 2019-03-01   53056
190 2019-04-01   71384
191 2019-05-01   52634
192 2019-06-01   59227
193 2019-07-01   69263
194 2019-08-01   55513
195 2019-09-01   47918
196 2019-10-01   55578
197 2019-11-01   62608
198 2019-12-01  109153
199 2020-01-01   75483
200 2020-02-01   71728
201 2020-03-01  662546
202 2020-04-01 1136925
203 2020-05-01  554862
204 2020-06-01  304180
205 2020-07-01  285143
206 2020-08-01  182912
207 2020-09-01  199033
208 2020-10-01  175712
209 2020-11-01  170416
210 2020-12-01  193882
211 2021-01-01  255898
212 2021-02-01  190934
213 2021-03-01  236812
214 2021-04-01  323497
215 2021-05-01  105053
216 2021-06-01   91284
217 2021-07-01   91869
218 2021-08-01   65228

In [43]:
dim(gdf)

[1] 218   2

In [44]:
write.csv(gdf,"datos.csv")